{
  "projects": [
    {
      "id": 1,
      "name": "Flashcards App",
      "image": "/images/flashcards.PNG",
      "description": "This project allows a user to create and use their own custom flashcards. I originally built this in HTML, CSS, and JavaScript in week 6 of Foundations at Dev Academy Aotearoa, and then recreated the entire project as a fullstack application in week 7 of Bootcamp. While building this app, I learnt how to incorporate JavaScript logic into React and React Query, reinforced my learning on prop drilling and state management in React, learnt how to create and query relational SQLite3 databases with many to many relationships, built my first dynamic form in React, and worked with the framer-motion npm package for the first time. While deploying this app, also I learnt how to refactor my code to query my production database as I migrated it to PostgreSQL.",
      "tech": [
      "Node.js",
      "React",
      "ReactQuery",
      "TypeScript",
      "CSS",
      "Knex",
      "SQLite3",
      "Express",
      "Superagent",
      "Vite"
      ],
      "deployedLink": "https://flashcards-app-production.up.railway.app/", 
      "repoLink": "https://github.com/HannahBurgoyne/flashcards-app"
    },
    {
      "id": 2,
      "name": "Urgent vet care",
      "image": "/images/vet_care_map.png",
      "description": "This in progress project is my first step into mobile development. The MVP will allow users to view a list of urgent veterinary clinics currently open in the area surrounding their location, and to save their favourite clinics to a list which they can visit at a later time.",
      "tech": [
        ".NET Core",
        "C#",
        "Postgres",
        "Google Maps API", 
        "Google Places API",
        "React Native",
        "ReactQuery",
        "TypeScript"
        ],
      
      "repoLink":  "https://github.com/HannahBurgoyne/urgent-vet-care"
    },
    {
      "id": 3,
      "name": "Get This! AI Assistant",
      "image": "/images/get_this.png",
      "description": "I collaborated on this hackathon project with a team of developers. GetThis is a browser extension which aims to enhance a user's ability to process and retain complex information by summarising text and quizzing the user on it, through the power of AI. We reached MVP in just 22 hours.",
      "tech": [
        "Node.js",
        "React",
        "ReactQuery",
        "TypeScript",
        "Tailwind CSS",
        "OpenAI GPT4.0 API",
        "Express",
        "Superagent",
        "Vite"
        ],
      "repoLink": "https://github.com/team-sharpies/chrome-extension"
    },
    {
      "id": 4,
      "name": "Crew",
      "image": "/images/crew.PNG",
      "description": "Crew is a social media app which I created in collaboration with my team for our final group project at Dev Academy Aotearoa. As Git Lead for the project, I was responsible for managing all branches in our Github repo. I set up a project board and ticketing system for our team, reviewed and merged all of the team's pull requests into the main branch, resolved merge conflicts and created hotfixes for bugs. Alongside this I worked on key features for the project, such as user authentication with Auth0, image-uploading using Multer, and querying databases with many-to-many relationships to achieve our RSVPs stretch goal.",
      "tech": [
        "Node.js", 
        "React", 
        "ReactQuery", 
        "TypeScript", 
        "Tailwind CSS", 
        "Knex", 
        "SQLite3", 
        "Express", 
        "Superagent", 
        "Vite", 
        "Vitest", 
        "Multer"
      ],
      "repoLink": "https://github.com/matai-2023/crew"
    
    }
  ]
}